# SnappingService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..SnappingService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Autodesk Internal: The service which provides snap points and lines
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId SnappingService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SnappingService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ SnappingService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace